tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"

cask_args appdir: "/Applications"

brew "bat"
brew "cmake"
brew "cocoapods"
brew "diff-so-fancy"
brew "jq"
brew "kubectl", link: true
brew "neovim"
brew "nodeenv"
brew "pyenv"
brew "rbenv"
brew "tree"

cask "docker"
cask "font-cica"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "slack"

