tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"

cask_args appdir: "/Applications"

##################
# zsh
##################
brew "sheldon"
brew "starship"

##################
# shell utils
##################
cask "fig"
cask "iterm2"
# cask "warp"

##################
# cui tools
##################
brew "asdf"
brew "bat"
brew "cmake"
brew "diff-so-fancy"
brew "exa"
brew "fzf"
brew "git"
brew "gitui"
brew "jq"
brew "kubectl"
brew "neovim"
brew "nmap"
brew "tree"
brew "yq"

##################
# fonts
##################
cask "font-cica"
cask "font-hackgen-nerd"
cask "font-Hack-nerd-font"

##################
# IDEs
##################
cask "webstorm"
cask "pycharm"

##################
# container
##################
brew "colima"
brew "docker"
brew "docker-compose"

##################
# GCP
##################
cask "google-cloud-sdk"

##################
# Utils
##################
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "notion"
cask "skitch"
cask "slack"
cask "spectacle"
cask "the-unarchiver"

