tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"

cask_args appdir: "/Applications"

brew "bat"
brew "carthage"
brew "cmake"
brew "cocoapods"
brew "diff-so-fancy"
brew "git"
brew "go"
brew "jq"
brew "kubectl", link: true
brew "mas"
brew "neovim"
brew "nodebrew"
brew "pwgen"
brew "pyenv"
brew "rbenv"
brew "ruby-build"
brew "ruby"
brew "rustup"
brew "tree"
brew "xcodegen"

cask "boostnote"
cask "docker"
cask "font-cica"
cask "google-chrome"
cask "google-japanese-ime"
cask "gyazo"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "slack"

mas "Skitch", id: 425955336
mas "The Unarchiver", id: 425424353
