tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"

cask_args appdir: "/Applications"

brew "bat"
brew "cmake"
brew "diff-so-fancy"
brew "exa"
brew "font-Hack-nerd-font"
brew "font-hackgen-nerd"
brew "fig"
brew "fzf"
brew "gitui"
brew "jq"
brew "kubectl"
brew "neovim"
brew "nodeenv"
brew "nyancat"
brew "pyenv"
brew "sheldon"
brew "tree"

cask "docker"
cask "font-cica"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "slack"
# cask "warp" いまいち使い勝手がよくなかったので保留

